{
  "projects": [
    {
      "id": 1,
      "name": "Happy Thoughts",
      "image": "/happythoughts.png",
      "description": "Un projet React axé sur le state management et les interactions avec les API pour la récupération et la publication de données. Les fonctionnalités incluent une interface utilisateur alignée sur le design, un compteur de likes pour chaque pensée et un formulaire pour de nouvelles pensées.",
      "tags": [
        "HTML5",
        "CSS3",
        "JavaScript",
        "React",
        "APIs"
      ],
      "netlify_url": "https://happythoughts-app.netlify.app/",
      "github_url": "https://github.com/almaherris/project-happy-thoughts-vite"
    },
    {
      "id": 2,
      "name": "Application Météo",
      "image": "/weatherapp.png",
      "description": "Une application météo récupérant les données météorologiques de l'API OpenWeatherMap. Les principales fonctionnalités incluent la présentation des données météorologiques, des fonctionnalités telles que l'affichage de la météo actuelle, des heures de lever/coucher du soleil, des prévisions sur 5 jours et une fonction de recherche.",
      "tags": [
        "HTML5",
        "CSS3",
        "JavaScript",
        "APIs"
      ],
      "netlify_url": "https://clear-skies-ahead.netlify.app/",
      "github_url": "https://github.com/almaherris/project-weather-app"
    },
    {
      "id": 3,
      "name": "Portail Musique",
      "image": "/musicproject.png",
      "description": "Un modèle d'application React pour afficher les sorties d'albums. Les fonctionnalités incluent une hiérarchie de composants, une fidélité au design et des mises en page adaptatives. Cliquer sur les albums ou les artistes redirige vers des URL externes. L'accent est mis sur le flux de données et les interactions utilisateur.",
      "tags": [
        "HTML5",
        "CSS3",
        "JavaScript",
        "React"
      ],
      "netlify_url": "https://musicreleaseproject-react.netlify.app/",
      "github_url": "https://github.com/almaherris/project-music-releases-vite"
    },
    {
      "id": 4,
      "name": "Chatbot",
      "image": "/chatbot.png",
      "description": "Un chatbot développé avec JavaScript axé sur la gestion des entrées utilisateur. Un flux conversationnel structuré a été implémenté, ainsi que des réponses conditionnelles pour les entrées non valides.",
      "tags": [
        "HTML5",
        "CSS3",
        "JavaScript"
      ],
      "netlify_url": "https://valentinescafe.netlify.app/",
      "github_url": "https://github.com/almaherris/project-chatbot"
    },
    {
      "id": 5,
      "name": "Sondage",
      "image": "/survey.png",
      "description": "Un projet React pour créer un formulaire de sondage. L'accent est mis sur React useState et le contrôle de formulaire. Suivi d'un design donné dans Figma et priorisation de l'accessibilité en utilisant Google Lighthouse.",
      "tags": [
        "HTML5",
        "CSS3",
        "JavaScript",
        "React"
      ],
      "netlify_url": "https://surprise-holiday.netlify.app/",
      "github_url": "https://github.com/almaherris/project-survey-vite"
    },
    {
      "id": 6,
      "name": "To Do List",
      "image": "/todo.png",
      "description": "Créer une application de tâches utilisant l'API Context permettant aux utilisateurs d'ajouter, de lister et de supprimer des tâches tout en garantissant un design épuré. Comprend une hiérarchie de composants et global state management.",
      "tags": [
        "HTML5",
        "CSS3",
        "JavaScript",
        "React"
      ],
      "netlify_url": "https://avocado-todo.netlify.app",
      "github_url": "https://github.com/almaherris/project-todos-context-vite"
    },
    {
      "id": 7,
      "name": "Collection de Films",
      "image": "/movies.png",
      "description": "Collection de films avec des données récupérées depuis l'API de themoviedb.org. Les fonctionnalités incluent l'affichage de la liste des films et la possibilité de consulter les détails d'un film individuel via React Router. L'accent est également mis sur la gestion des erreurs et les états de chargement.",
      "tags": [
        "HTML5",
        "CSS3",
        "JavaScript",
        "React",
        "APIs"
      ],
      "netlify_url": "https://movies-reactrouter.netlify.app/",
      "github_url": "https://github.com/almaherris/project-movies-vite"
    },
    {
      "id": 8,
      "name": "Jeu Labyrinthe",
      "image": "/labyrinth.png",
      "description": "Une aventure construite en utilisant Zustand pour la gestion d'état et une API pour envoyer et chercher des données. Dans ce jeu interactif, les joueurs naviguent à travers une série de choix basés sur les descriptions et actions fournies par l'API. Le projet inclut également la création d'une interface user-friendly et la gestion des états de chargement.",
      "tags": [
        "HTML5",
        "CSS3",
        "JavaScript",
        "React",
        "APIer"
      ],
      "netlify_url": "https://alma-wen-labyrinth.netlify.app/",
      "github_url": "https://github.com/almaherris/project-labyrinth-zustand-vite"
    },
    {
      "id": 9,
      "name": "Collaboration UX",
      "image": "/ux-handoff.png",
      "description": "Dans ce projet, j'ai intégré le design d'un étudiant UX dans une landing page pour un club de fitness utilisant React et Tailwind. Ce projet comble le fossé entre la conception et le développement, mettant en valeur l'art de donner vie aux images avec du code.",
      "tags": [
        "HTML5",
        "Tailwind",
        "JavaScript",
        "React",
        "APIer"
      ],
      "netlify_url": "https://urban-spin.netlify.app/",
      "github_url": "https://github.com/almaherris/project-design-handoff-vite"
    }
  ]
}
